; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v6 ?v11)
             (pred_8 ?v5 ?v10)
             (pred_12 ?v6 ?v10)
             (pred_9 ?v7 ?v6 )
	     (pred_3 ?v6)
             (pred_5 ?v1)
             (pred_4 ?v5)
             (pred_10 ?v10)
             (pred_7 ?v6)
             (pred_2 ?v5)
             (pred_1 ?v6)
             (pred_11 ))



(:action op_3
:parameters (?v12 ?v13 ?v3 ?v8)
:precondition (and (pred_5 ?v12) (pred_5 ?v13) (pred_4 ?v3) (pred_10 ?v8)
          (pred_6 ?v12 ?v13) (pred_8 ?v3 ?v8)
                   (pred_12 ?v13 ?v8) (pred_3 ?v12) 
                   (pred_7 ?v13) (pred_2 ?v3))
:effect (and  (pred_1 ?v13) (not (pred_7 ?v13))))


(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_5 ?v12) (pred_5 ?v2)
               (pred_3 ?v12) (pred_6 ?v12 ?v2) (pred_1 ?v2))
:effect (and (pred_3 ?v2) (not (pred_3 ?v12))))

(:action op_4
:parameters (?v12 ?v3)
:precondition (and (pred_5 ?v12) (pred_4 ?v3) 
                  (pred_3 ?v12) (pred_9 ?v3 ?v12) (pred_11 ))
:effect (and (pred_2 ?v3)
   (not (pred_9 ?v3 ?v12)) (not (pred_11 ))))


(:action op_5
:parameters (?v12 ?v4 ?v9)
:precondition (and (pred_5 ?v12) (pred_4 ?v4) (pred_4 ?v9)
                  (pred_3 ?v12) (pred_2 ?v9) (pred_9 ?v4 ?v12))
:effect (and (pred_2 ?v4) (pred_9 ?v9 ?v12)
        (not (pred_2 ?v9)) (not (pred_9 ?v4 ?v12))))

(:action op_1
:parameters (?v12 ?v3)
:precondition (and (pred_5 ?v12) (pred_4 ?v3) 
                  (pred_3 ?v12) (pred_2 ?v3))
:effect (and (pred_11 ) (pred_9 ?v3 ?v12) (not (pred_2 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_06 obj_13 obj_10 obj_08 obj_14 obj_12 obj_18 obj_04 obj_01 obj_19 obj_20 obj_09 obj_05 obj_21 obj_07 obj_03
    obj_11 obj_02 obj_16
    obj_22 obj_15 obj_17
    )

    (:init
       (pred_11)

       (pred_5 obj_06)
       (pred_5 obj_13)
       (pred_5 obj_10)
       (pred_5 obj_08)
       (pred_5 obj_14)
       (pred_5 obj_12)
       (pred_5 obj_18)
       (pred_5 obj_04)
       (pred_5 obj_01)
       (pred_5 obj_19)
       (pred_5 obj_20)
       (pred_5 obj_09)
       (pred_5 obj_05)
       (pred_5 obj_21)
       (pred_5 obj_07)
       (pred_5 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_4 obj_22)
       (pred_4 obj_15)
       (pred_4 obj_17)

       (pred_6 obj_06 obj_14)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_13 obj_12)
       (pred_6 obj_13 obj_10)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_10 obj_13)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_14 obj_01)
       (pred_6 obj_14 obj_12)
       (pred_6 obj_14 obj_06)
       (pred_6 obj_12 obj_19)
       (pred_6 obj_12 obj_18)
       (pred_6 obj_12 obj_13)
       (pred_6 obj_12 obj_14)
       (pred_6 obj_18 obj_20)
       (pred_6 obj_18 obj_04)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_12)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_04 obj_18)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_01 obj_19)
       (pred_6 obj_01 obj_14)
       (pred_6 obj_19 obj_21)
       (pred_6 obj_19 obj_20)
       (pred_6 obj_19 obj_12)
       (pred_6 obj_19 obj_01)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_09)
       (pred_6 obj_20 obj_18)
       (pred_6 obj_20 obj_19)
       (pred_6 obj_09 obj_03)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_20)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_01)
       (pred_6 obj_21 obj_07)
       (pred_6 obj_21 obj_19)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_07 obj_03)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_21)
       (pred_6 obj_03 obj_09)
       (pred_6 obj_03 obj_07)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_04)
       (pred_12  obj_06 obj_11)
       (pred_12  obj_12 obj_02)
       (pred_12  obj_04 obj_16)
       (pred_1 obj_13)
       (pred_1 obj_10)
       (pred_1 obj_08)
       (pred_1 obj_14)
       (pred_1 obj_18)
       (pred_1 obj_01)
       (pred_1 obj_19)
       (pred_1 obj_20)
       (pred_1 obj_09)
       (pred_1 obj_05)
       (pred_1 obj_21)
       (pred_1 obj_07)
       (pred_1 obj_03)

       (pred_8  obj_22 obj_11)
       (pred_8  obj_15 obj_02)
       (pred_8  obj_17 obj_16)
       (pred_9 obj_22 obj_10)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_17 obj_14)
       (pred_3 obj_14)
    )

    (:goal (and
       (pred_9 obj_22 obj_13)
    ))
(:constraints
  (always (not (pred_3 obj_19)))
)
)

; plan
1. (op_2 obj_14 obj_01)
   deleted: (pred_3 obj_14)
   added: (pred_3 obj_01)
   goals met: 0 of 1
2. (op_2 obj_01 obj_05)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_05)
   goals met: 0 of 1
3. (op_2 obj_05 obj_21)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_21)
   goals met: 0 of 1
4. (op_2 obj_21 obj_07)
   deleted: (pred_3 obj_21)
   added: (pred_3 obj_07)
   goals met: 0 of 1
5. (op_2 obj_07 obj_20)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_2 obj_20 obj_18)
   deleted: (pred_3 obj_20)
   added: (pred_3 obj_18)
   goals met: 0 of 1
7. (op_2 obj_18 obj_10)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_10)
   goals met: 0 of 1
8. (op_4 obj_10 obj_22)
   deleted: (pred_9 obj_22 obj_10) (pred_11)
   added: (pred_2 obj_22)
   goals met: 0 of 1
9. (op_2 obj_10 obj_13)
   deleted: (pred_3 obj_10)
   added: (pred_3 obj_13)
   goals met: 0 of 1
10. (op_1 obj_13 obj_22)
   deleted: (pred_2 obj_22)
   added: (pred_11) (pred_9 obj_22 obj_13)
   goals met: 1 of 1
